In [1]:
# Lambda

In [2]:
def func1(x):
    return x+5

In [3]:
func1(5)

10

In [14]:
func2=lambda x:x+5

In [15]:
func2(5)

10

In [16]:
def func3(x):
    func4=lambda x:x+8
    return func4(x)+12

In [17]:
func3(10)

30

In [22]:
func5=lambda x,y:x+y

In [23]:
func5(10,20)

30

In [24]:
# Map function

In [37]:
lst=[1,2,3,4,-1,-2,10,20]
map_1=map(lambda x:x**2,lst)

In [38]:
map_1

In [39]:
list(map_1)

[1, 4, 9, 16, 1, 4, 100, 400]

In [40]:
map_2=map(lambda x:x>0,lst)

In [41]:
list(map_2)

[True, True, True, True, False, False, True, True]

In [42]:
map_3=map(lambda x:x%2==0,lst)

In [43]:
list(map_3)

[False, True, False, True, False, True, True, True]

In [54]:
lst1=['a','b','e','i','d','f','g','m']

In [58]:
map_4=map(lambda x:x in ['a','e','i','o','u'],lst1)

In [59]:
list(map_4)

[True, False, True, True, False, False, False, False]

In [1]:
# Sort

In [2]:
attendence=[35,39,32,37,30,33]

In [3]:
att_sort=sorted(attendence)

In [4]:
att_sort

[30, 32, 33, 35, 37, 39]

In [5]:
attendence.sort(key=lambda x:x*1.5)

In [6]:
attendence

[30, 32, 33, 35, 37, 39]

In [8]:
attendence.sort(key=lambda x:x==30)

In [9]:
attendence

[32, 33, 35, 37, 39, 30]

In [10]:
# sort by 2nd parameter

In [12]:
lst=[('9A',35),('9B',37),('9C',30),('9D',32),('9E',34)]

In [14]:
lst_sorted=sorted(lst)
lst_sorted

[('9A', 35), ('9B', 37), ('9C', 30), ('9D', 32), ('9E', 34)]

In [16]:
lst_sorted2=sorted(lst,key=lambda x:x[1])
lst_sorted2

[('9C', 30), ('9D', 32), ('9E', 34), ('9A', 35), ('9B', 37)]

# Case-1: Filter data with lambda

In [19]:
abv_avg_att=filter(lambda x:x>35,attendence)
list(abv_avg_att)

[39, 37]

In [ ]:
# Find countries whoose length is greater than 3

In [20]:
countries=['India',"China","UK","US","Germany","UAE"]
length_g_3=filter(lambda x:len(x)>3,countries)
list(length_g_3)

['India', 'China', 'Germany']

# Case-2: Reduce and lambda

In [21]:
nums=[10,20,30,40,50] 
# Add all the elements of the above list by using reduce function

In [23]:
from functools import reduce
sum_list=reduce(lambda x,y:x+y,nums)
print(sum_list)

150

In [25]:
# Find maximum
max_list=reduce(lambda x,y:x if x>y else y,nums)
print(max_list)

50

In [26]:
# Find minimum
min_list=reduce(lambda x,y:x if x<y else y,nums)
print(min_list)

10

# Case-3 Map with lambda

In [27]:
sales=[{'country':'India','Sales':150.5},
      {'country':'Germany','Sales':350.5},
      {'country':'UK','Sales':180.5},
      {'country':'US','Sales':450.0},
      {'country':'Bangladesh','Sales':100.5},
      {'country':'Nepal','Sales':50.5}]

In [30]:
# Find keys and values list
country_values=map(lambda x:x['country'],sales)
list(country_values)

['India', 'Germany', 'UK', 'US', 'Bangladesh', 'Nepal']

In [31]:
sales_values=map (lambda x:x['Sales'],sales)
list(sales_values)

[150.5, 350.5, 180.5, 450.0, 100.5, 50.5]

In [32]:
# Filter dictionaries with lambda
india_sales=filter(lambda x:x['country']=='India',sales)
list(india_sales)

[{'country': 'India', 'Sales': 150.5}]

In [34]:
greater_sales=filter(lambda x:x['Sales']>200,sales)
list(greater_sales)

[{'country': 'Germany', 'Sales': 350.5}, {'country': 'US', 'Sales': 450.0}]

In [35]:
# Lambda on nested list:
scores=[[1,35,80],[2,32,75],[3,30,82],[4,33,75],[5,37,60]]

In [36]:
# problem: if student has above average(35) add 2 marks to existing marks else substract 2 marks from existing marks

In [38]:
abv_avg=35
new_marks=map(lambda x:x[2]+2 if x[1]>abv_avg else x[2]-2,scores)
list(new_marks)

[78, 73, 80, 73, 62]

In [1]:
#

In [4]:
import pandas as pd
import numpy as np

In [9]:
#

In [5]:
s0=pd.Series([1,2,3,np.nan])

In [6]:
s0.map(lambda x:f'Number:{x}',na_action=None)

0    Number:1.0
1    Number:2.0
2    Number:3.0
3    Number:nan
dtype: object

In [8]:
s0.map(lambda x:f'Number:{x}',na_action='ignore')

0    Number:1.0
1    Number:2.0
2    Number:3.0
3           NaN
dtype: object

In [12]:
#  convert string into numeric/float through map

In [21]:
perc=pd.Series(['90.9%','95.2%','94%'])

In [22]:
perc.map(lambda x:float(x[:-1]))

0    90.9
1    95.2
2    94.0
dtype: float64

In [25]:
df_perc=pd.DataFrame(perc,columns=['percentage'])

In [26]:
df_perc

  percentage
0      90.9%
1      95.2%
2        94%

In [27]:
df_perc['modfied']=perc.map(lambda x:float(x[:-1]))

In [28]:
df_perc

  percentage  modfied
0      90.9%     90.9
1      95.2%     95.2
2        94%     94.0

In [31]:
price=pd.Series(['$100','$95','$94'])

In [30]:
price

0    $100
1    $95%
2    $94%
dtype: object

In [36]:
df_sales=pd.DataFrame(['imac','ipad','iphone'],columns=['gadget'])

In [37]:
df_sales['price']=price

In [38]:
df_sales

   gadget price
0    imac  $100
1    ipad   $95
2  iphone   $94

In [39]:
qty=[10,13,45]
df_sales['qty']=qty
df_sales

   gadget price  qty
0    imac  $100   10
1    ipad   $95   13
2  iphone   $94   45

In [40]:
df_sales['total']=price.map(lambda x:float(x[1:]))*df_sales['qty']

In [41]:
df_sales

   gadget price  qty   total
0    imac  $100   10  1000.0
1    ipad   $95   13  1235.0
2  iphone   $94   45  4230.0

In [42]:
# using regular functions

In [43]:
users=pd.Series(['John A Smith','Jennefer M Brown','David D Moore'])
users

0        John A Smith
1    Jennefer M Brown
2       David D Moore
dtype: object

In [44]:
def initials_1(name):
    initials=''
    name_list=name.split()
    for name in name_list:
        initials=initials+name[0]
    return initials

In [45]:
initials_1('John A Smith')

'JAS'

In [47]:
users.apply(initials_1)

0    JAS
1    JMB
2    DDM
dtype: object

In [48]:
def initials_2(name):
    return ''.join([x[0] for x in name.split()])

In [49]:
users.map(initials_2)

0    JAS
1    JMB
2    DDM
dtype: object

In [50]:
users.map(initials_1)

0    JAS
1    JMB
2    DDM
dtype: object

In [51]:
# using dictionary

In [52]:
numbers=pd.Series(range(0,6))
seasons={1:'Sprint',2:'Sumer',3:'Fall',4:'Winter'}
numbers.map(seasons)

0       NaN
1    Sprint
2     Sumer
3      Fall
4    Winter
5       NaN
dtype: object

In [53]:
#

In [71]:
dict1={'A':[1,2,3,4],'B':[10,20,30,40],'C':[20,40,60,80]}
idx=['Row1','Row2','Row3','Row4']

In [72]:
df=pd.DataFrame(dict1,index=idx)

In [73]:
df

      A   B   C
Row1  1  10  20
Row2  2  20  40
Row3  3  30  60
Row4  4  40  80

In [74]:
def custom_sum(row):
    return row.sum()

In [75]:
df['D(tot)']=df.apply(custom_sum,axis=1)

In [76]:
df

      A   B   C  D(tot)
Row1  1  10  20      31
Row2  2  20  40      62
Row3  3  30  60      93
Row4  4  40  80     124

In [77]:
df.loc['Row5(tot)']=df.apply(custom_sum,axis=0)

In [78]:
df

            A    B    C  D(tot)
Row1        1   10   20      31
Row2        2   20   40      62
Row3        3   30   60      93
Row4        4   40   80     124
Row5(tot)  10  100  200     310

In [107]:
dict1={'Maths':[78,92,63,54],'Science':[80,60,70,50],'Statistics':[90,60,50,98]}
students=['Peter','John','Smith','Anne']
marks=pd.DataFrame(dict1,index=students)
marks

       Maths  Science  Statistics
Peter     78       80          90
John      92       60          60
Smith     63       70          50
Anne      54       50          98

In [108]:
marks['Total']=marks.apply(custom_sum,axis=1)

In [109]:
marks

       Maths  Science  Statistics  Total
Peter     78       80          90    248
John      92       60          60    212
Smith     63       70          50    183
Anne      54       50          98    202

In [113]:
marks['Percentage']=((marks['Total']/300)*100).round(2)

In [114]:
marks

       Maths  Science  Statistics  Total  Percentage
Peter     78       80          90    248       82.67
John      92       60          60    212       70.67
Smith     63       70          50    183       61.00
Anne      54       50          98    202       67.33

In [120]:
def grade(per):
    if per>=90:
        return 'A'
    elif per>=80 and per<90:
        return 'B'
    elif per>=70 and per<80:
        return 'C'
    else:
        return 'Pass'

In [121]:
marks['Grade']=marks['Percentage'].apply(grade)

In [122]:
marks

       Maths  Science  Statistics  Total  Percentage Grade
Peter     78       80          90    248       82.67     B
John      92       60          60    212       70.67     C
Smith     63       70          50    183       61.00  Pass
Anne      54       50          98    202       67.33  Pass

In [123]:
# use of applymap(only for df)

In [124]:
dict1={'A':[1,2,3,4],'B':[10,20,30,40],'C':[20,40,60,80]}
idx=['Row1','Row2','Row3','Row4']

In [127]:
df1=pd.DataFrame(dict1,index=idx)

In [128]:
df1

      A   B   C
Row1  1  10  20
Row2  2  20  40
Row3  3  30  60
Row4  4  40  80

In [129]:
df1.applymap(np.square)

       A     B     C
Row1   1   100   400
Row2   4   400  1600
Row3   9   900  3600
Row4  16  1600  6400

In [132]:
df1

      A   B   C
Row1  1  10  20
Row2  2  20  40
Row3  3  30  60
Row4  4  40  80

In [133]:
df1.apply(custom_sum,axis=1)

Row1     31
Row2     62
Row3     93
Row4    124
dtype: int64

In [134]:
df1.apply(custom_sum,axis=1,result_type='broadcast')

        A    B    C
Row1   31   31   31
Row2   62   62   62
Row3   93   93   93
Row4  124  124  124

In [135]:
df1

      A   B   C
Row1  1  10  20
Row2  2  20  40
Row3  3  30  60
Row4  4  40  80

In [136]:
def cal_multi_col(row):
    return [row['A']*2,row['B']*3]

In [137]:
df1.apply(cal_multi_col,axis=1,result_type='expand')

      0    1
Row1  2   30
Row2  4   60
Row3  6   90
Row4  8  120

In [10]:
# different methods of using filtering in pandas
import numpy as np

In [2]:
import pandas as pd



# information about employees

id_number = ['128', '478', '257', '299', '175', '328', '099', '457', '144', '222']

name = ['Patrick', 'Amanda', 'Antonella', 'Eduard', 'John', 'Alejandra', 'Layton', 'Melanie', 'David', 'Lewis']

surname = ['Miller', 'Torres', 'Brown', 'Iglesias', 'Wright', 'Campos', 'Platt', 'Cavill', 'Lange', 'Bellow']

division = ['Sales', 'IT', 'IT', 'Sales', 'Marketing', 'Engineering', 'Engineering', 'Sales', 'Engineering', 'Sales']

salary = [30000, 54000, 80000, 79000, 15000, 18000, 30000, 35000, 45000, 30500]

telephone = ['7366578', '7366444', '7366120', '7366574', '7366113', '7366117', '7366777', '7366579', '7366441', '7366440']

type_contract = ['permanent', 'temporary', 'temporary', 'permanent', 'internship', 'internship', 'permanent', 'temporary', 'permanent', 'permanent']



# data frame containing information about employees

df_employees = pd.DataFrame({'name': name, 'surname': surname, 'division': division,

'salary': salary, 'telephone': telephone, 'type_contract': type_contract}, index=id_number)



df_employees

          name   surname     division  salary telephone type_contract
128    Patrick    Miller        Sales   30000   7366578     permanent
478     Amanda    Torres           IT   54000   7366444     temporary
257  Antonella     Brown           IT   80000   7366120     temporary
299     Eduard  Iglesias        Sales   79000   7366574     permanent
175       John    Wright    Marketing   15000   7366113    internship
328  Alejandra    Campos  Engineering   18000   7366117    internship
099     Layton     Platt  Engineering   30000   7366777     permanent
457    Melanie    Cavill        Sales   35000   7366579     temporary
144      David     Lange  Engineering   45000   7366441     permanent
222      Lewis    Bellow        Sales   30500   7366440     permanent

In [3]:
salary=df_employees['salary']

In [4]:
salary

128    30000
478    54000
257    80000
299    79000
175    15000
328    18000
099    30000
457    35000
144    45000
222    30500
Name: salary, dtype: int64

In [5]:
print(type(salary))

<class 'pandas.core.series.Series'>

In [6]:
df_employees['salary']

128    30000
478    54000
257    80000
299    79000
175    15000
328    18000
099    30000
457    35000
144    45000
222    30500
Name: salary, dtype: int64

In [7]:
df_employees[['salary']]

     salary
128   30000
478   54000
257   80000
299   79000
175   15000
328   18000
099   30000
457   35000
144   45000
222   30500

In [8]:
df_employees[['division','salary']]

        division  salary
128        Sales   30000
478           IT   54000
257           IT   80000
299        Sales   79000
175    Marketing   15000
328  Engineering   18000
099  Engineering   30000
457        Sales   35000
144  Engineering   45000
222        Sales   30500

In [11]:
numeric_inputs=df_employees.select_dtypes(include=np.number)

In [12]:
numeric_inputs.columns

Index(['salary'], dtype='object')

In [14]:
type(numeric_inputs)

pandas.core.frame.DataFrame

In [16]:
numeric_inputs_2=df_employees.select_dtypes(include='number')

In [18]:
numeric_inputs_2.columns

Index(['salary'], dtype='object')

In [19]:
type(numeric_inputs_2)

pandas.core.frame.DataFrame

In [20]:
numeric_inputs

     salary
128   30000
478   54000
257   80000
299   79000
175   15000
328   18000
099   30000
457   35000
144   45000
222   30500

In [21]:
df_employees.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, 128 to 222
Data columns (total 6 columns):
name             10 non-null object
surname          10 non-null object
division         10 non-null object
salary           10 non-null int64
telephone        10 non-null object
type_contract    10 non-null object
dtypes: int64(1), object(5)
memory usage: 880.0+ bytes

In [22]:
df_employees.dtypes

name             object
surname          object
division         object
salary            int64
telephone        object
type_contract    object
dtype: object

In [23]:
df_employees.index

Index(['128', '478', '257', '299', '175', '328', '099', '457', '144', '222'], dtype='object')

In [24]:
df_employees.loc['478']

name                Amanda
surname             Torres
division                IT
salary               54000
telephone          7366444
type_contract    temporary
Name: 478, dtype: object

In [25]:
df_employees.loc[['478','222']]

       name surname division  salary telephone type_contract
478  Amanda  Torres       IT   54000   7366444     temporary
222   Lewis  Bellow    Sales   30500   7366440     permanent

In [26]:
df_employees.iloc[0]

name               Patrick
surname             Miller
division             Sales
salary               30000
telephone          7366578
type_contract    permanent
Name: 128, dtype: object

In [27]:
df_employees.iloc[-1]

name                 Lewis
surname             Bellow
division             Sales
salary               30500
telephone          7366440
type_contract    permanent
Name: 222, dtype: object

In [28]:
df_employees.shape

(10, 6)

In [29]:
df_employees.iloc[[0,1,2,3,4]]

          name   surname   division  salary telephone type_contract
128    Patrick    Miller      Sales   30000   7366578     permanent
478     Amanda    Torres         IT   54000   7366444     temporary
257  Antonella     Brown         IT   80000   7366120     temporary
299     Eduard  Iglesias      Sales   79000   7366574     permanent
175       John    Wright  Marketing   15000   7366113    internship

In [30]:
df_employees.iloc[0:5]

          name   surname   division  salary telephone type_contract
128    Patrick    Miller      Sales   30000   7366578     permanent
478     Amanda    Torres         IT   54000   7366444     temporary
257  Antonella     Brown         IT   80000   7366120     temporary
299     Eduard  Iglesias      Sales   79000   7366574     permanent
175       John    Wright  Marketing   15000   7366113    internship

In [31]:
df_employees.iloc[1,3]

54000

In [34]:
df_employees.loc['478','salary']

54000

In [37]:
df_employees.iloc[1,[0,1,3]]

name       Amanda
surname    Torres
salary      54000
Name: 478, dtype: object

In [38]:
df_employees.loc['478',['name','surname','salary']]

name       Amanda
surname    Torres
salary      54000
Name: 478, dtype: object

In [39]:
df_employees.iloc[[1,9],[0,1,3]]

       name surname  salary
478  Amanda  Torres   54000
222   Lewis  Bellow   30500

In [40]:
df_employees.loc[['478','222'],['name','surname','salary']]

       name surname  salary
478  Amanda  Torres   54000
222   Lewis  Bellow   30500

In [41]:
df_employees.iloc[:4,[0,1,3]]

          name   surname  salary
128    Patrick    Miller   30000
478     Amanda    Torres   54000
257  Antonella     Brown   80000
299     Eduard  Iglesias   79000

In [42]:
df_employees.loc[:'299',['name','surname','salary']]

          name   surname  salary
128    Patrick    Miller   30000
478     Amanda    Torres   54000
257  Antonella     Brown   80000
299     Eduard  Iglesias   79000

In [43]:
df_employees.head()

          name   surname   division  salary telephone type_contract
128    Patrick    Miller      Sales   30000   7366578     permanent
478     Amanda    Torres         IT   54000   7366444     temporary
257  Antonella     Brown         IT   80000   7366120     temporary
299     Eduard  Iglesias      Sales   79000   7366574     permanent
175       John    Wright  Marketing   15000   7366113    internship

In [44]:
df_employees.iat[1,3]

54000

In [45]:
df_employees.at['478','salary']

54000

In [46]:
df_employees['salary']>45000

128    False
478     True
257     True
299     True
175    False
328    False
099    False
457    False
144    False
222    False
Name: salary, dtype: bool

In [47]:
df_employees[df_employees['salary']>45000]

          name   surname division  salary telephone type_contract
478     Amanda    Torres       IT   54000   7366444     temporary
257  Antonella     Brown       IT   80000   7366120     temporary
299     Eduard  Iglesias    Sales   79000   7366574     permanent

In [48]:
df_employees[(df_employees['salary']>45000) & (df_employees['type_contract']=='permanent')]

       name   surname division  salary telephone type_contract
299  Eduard  Iglesias    Sales   79000   7366574     permanent

In [51]:
df_employees[(df_employees['type_contract']=='temporary')|(df_employees['type_contract']=='permanent')]

          name   surname     division  salary telephone type_contract
128    Patrick    Miller        Sales   30000   7366578     permanent
478     Amanda    Torres           IT   54000   7366444     temporary
257  Antonella     Brown           IT   80000   7366120     temporary
299     Eduard  Iglesias        Sales   79000   7366574     permanent
099     Layton     Platt  Engineering   30000   7366777     permanent
457    Melanie    Cavill        Sales   35000   7366579     temporary
144      David     Lange  Engineering   45000   7366441     permanent
222      Lewis    Bellow        Sales   30500   7366440     permanent

In [52]:
df_employees[df_employees['type_contract'].isin(['temporary','permanent'])]

          name   surname     division  salary telephone type_contract
128    Patrick    Miller        Sales   30000   7366578     permanent
478     Amanda    Torres           IT   54000   7366444     temporary
257  Antonella     Brown           IT   80000   7366120     temporary
299     Eduard  Iglesias        Sales   79000   7366574     permanent
099     Layton     Platt  Engineering   30000   7366777     permanent
457    Melanie    Cavill        Sales   35000   7366579     temporary
144      David     Lange  Engineering   45000   7366441     permanent
222      Lewis    Bellow        Sales   30500   7366440     permanent

In [53]:
df_employees[df_employees['salary'].between(30000,80000)] # 30k and 80k are inclusive

          name   surname     division  salary telephone type_contract
128    Patrick    Miller        Sales   30000   7366578     permanent
478     Amanda    Torres           IT   54000   7366444     temporary
257  Antonella     Brown           IT   80000   7366120     temporary
299     Eduard  Iglesias        Sales   79000   7366574     permanent
099     Layton     Platt  Engineering   30000   7366777     permanent
457    Melanie    Cavill        Sales   35000   7366579     temporary
144      David     Lange  Engineering   45000   7366441     permanent
222      Lewis    Bellow        Sales   30500   7366440     permanent

In [56]:
df_employees[df_employees['salary'].between(30000,80000,inclusive=False)] # 30k and 80k are not inclusive

        name   surname     division  salary telephone type_contract
478   Amanda    Torres           IT   54000   7366444     temporary
299   Eduard  Iglesias        Sales   79000   7366574     permanent
457  Melanie    Cavill        Sales   35000   7366579     temporary
144    David     Lange  Engineering   45000   7366441     permanent
222    Lewis    Bellow        Sales   30500   7366440     permanent

In [57]:
# same below without between

In [58]:
df_employees[(df_employees['salary']>=30000) & (df_employees['salary']<=80000)]

          name   surname     division  salary telephone type_contract
128    Patrick    Miller        Sales   30000   7366578     permanent
478     Amanda    Torres           IT   54000   7366444     temporary
257  Antonella     Brown           IT   80000   7366120     temporary
299     Eduard  Iglesias        Sales   79000   7366574     permanent
099     Layton     Platt  Engineering   30000   7366777     permanent
457    Melanie    Cavill        Sales   35000   7366579     temporary
144      David     Lange  Engineering   45000   7366441     permanent
222      Lewis    Bellow        Sales   30500   7366440     permanent

In [59]:
df_employees[df_employees['telephone'].str.contains('57')]

        name   surname division  salary telephone type_contract
128  Patrick    Miller    Sales   30000   7366578     permanent
299   Eduard  Iglesias    Sales   79000   7366574     permanent
457  Melanie    Cavill    Sales   35000   7366579     temporary

In [61]:
df_employees[df_employees['name'].str.startswith('A')]

          name surname     division  salary telephone type_contract
478     Amanda  Torres           IT   54000   7366444     temporary
257  Antonella   Brown           IT   80000   7366120     temporary
328  Alejandra  Campos  Engineering   18000   7366117    internship

In [1]:
# str methods in pandas

In [2]:
import pandas as pd
import numpy as np

In [10]:
s=pd.Series(['python is awesome. I love python.','java is just ok.','c++ is overrated. You should consider learning another language, like java or python.'])

In [11]:
s

0                    python is awesome. I love python.
1                                     java is just ok.
2    c++ is overrated. You should consider learning...
dtype: object

In [14]:
print(s.str.count('python'))

0    2
1    0
2    1
dtype: int64

In [15]:
s2=pd.Series(['100','unkown','20','240','unknown','100'])

In [16]:
s2

0        100
1     unkown
2         20
3        240
4    unknown
5        100
dtype: object

In [17]:
s2.str.isdigit()

0     True
1    False
2     True
3     True
4    False
5     True
dtype: bool

In [18]:
s2.str.match('100')

0     True
1    False
2    False
3    False
4    False
5     True
dtype: bool

In [19]:
s2.str.match('un')

0    False
1     True
2    False
3    False
4     True
5    False
dtype: bool

In [22]:
s.str.upper().str.lower()

0                    python is awesome. i love python.
1                                     java is just ok.
2    c++ is overrated. you should consider learning...
dtype: object

In [24]:
s.str.len()

0    33
1    16
2    85
dtype: int64

In [25]:
s3=pd.Series([' python','java','ruby ','fortran '])
print(s3)

0      python
1        java
2       ruby
3    fortran
dtype: object

In [26]:
s3.str.lstrip()

0      python
1        java
2       ruby
3    fortran
dtype: object

In [27]:
s3.str.rstrip()

0     python
1       java
2       ruby
3    fortran
dtype: object

In [28]:
s4=pd.Series(['python\n','java\n','ruby\n','fortran\n'])

In [29]:
s4

0     python\n
1       java\n
2       ruby\n
3    fortran\n
dtype: object

In [30]:
s4.str.strip('\n')

0     python
1       java
2       ruby
3    fortran
dtype: object

In [34]:
s5=pd.Series(['$#1200','dollar1,000','dollar10000','$500'])

In [35]:
s5

0         $#1200
1    dollar1,000
2    dollar10000
3           $500
dtype: object

In [33]:
s5.str.replace('#','')

0          $1200
1     dollar,000
2    dollar10000
3           $500
dtype: object

In [36]:
s5.str.replace('dollar','$')

0    $#1200
1    $1,000
2    $10000
3      $500
dtype: object

In [37]:
s5.str.replace(',','')

0         $#1200
1     dollar1000
2    dollar10000
3           $500
dtype: object